{
  "_index": {
    "name": "Anatomy of Flowering Plants"
  },
  "_children": [
    {
      "_type": "single_mcq",
      "body": "<p>Which of the following simple tissues are commonly found in the fruit walls of nuts and pulp of pear?</p>",
      "options": [
        {
          "key": "A",
          "value": "Sclereids\n"
        },
        {
          "key": "B",
          "value": "Fibres\n"
        },
        {
          "key": "C",
          "value": "Parenchyma\n"
        },
        {
          "key": "D",
          "value": "Collenchyma\n"
        }
      ],
      "answer": "A",
      "explanation": "<p>The correct answer is <strong>Option A: Sclereids</strong>. Here's why:</p>\n\n<p>Sclereids are a type of sclerenchyma tissue, characterized by their thick, lignified cell walls. These rigid cells provide structural support and protection. They are commonly found in the hard, protective layers of nuts and the gritty texture of pear pulp. Let's break down why the other options are incorrect:</p>\n\n<ul>\n\n<li><strong>Fibres</strong> are another type of sclerenchyma tissue, but they are long and slender, providing tensile strength. While they are present in some plant structures, they are not the primary component of nut shells or pear pulp.</li>\n\n<li><strong>Parenchyma</strong> cells are thin-walled and loosely packed, making them suitable for storage and photosynthesis. They are found throughout plants but don't provide the same level of rigidity as sclereids.</li>\n\n<li><strong>Collenchyma</strong> cells have thickened cell walls at the corners, offering flexibility and support to young, growing tissues. They are not typically found in mature fruit structures.</li>\n\n</ul>\n\n<p>In summary, the presence of sclereids with their thick, lignified walls explains the hardness of nut shells and the gritty texture of pear pulp. </p>\n\n<p></p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>Given below are two statements:</p>\n<p>Statement I: In a dicotyledonous leaf, the adaxial epidermis generally bears more stomata than the abaxial \nepidermis.</p>\n<p>Statement II: In a dicotyledonous leaf, the adaxially placed palisade parenchyma is made up of elongated \ncells, which are arranged vertically and parallel to each other.</p>\n<p>In the light of the above statements, choose the correct answer from the options given below:</p>",
      "options": [
        {
          "key": "A",
          "value": "Statement I is true but Statement II is false\n"
        },
        {
          "key": "B",
          "value": "Statement I is false but Statement II is true\n"
        },
        {
          "key": "C",
          "value": "Both Statement I and Statement II are true\n"
        },
        {
          "key": "D",
          "value": "Both Statement I and Statement II are false"
        }
      ],
      "answer": "B",
      "explanation": "<p>To evaluate the given statements about dicotyledonous leaves, let's break down each statement and understand its validity.</p>\n\n<p><strong>Statement I:</strong> In a dicotyledonous leaf, the adaxial epidermis generally bears more stomata than the abaxial epidermis.</p>\n\n<p>This statement is generally false. In most dicotyledonous leaves, the abaxial (lower) epidermis typically has more stomata than the adaxial (upper) epidermis. This adaptation helps in efficient gas exchange while minimizing water loss as the lower surface is less exposed to direct sunlight.</p>\n\n<p><strong>Statement II:</strong> In a dicotyledonous leaf, the adaxially placed palisade parenchyma is made up of elongated cells, which are arranged vertically and parallel to each other.</p>\n\n<p>This statement is true. The palisade parenchyma in dicotyledonous leaves is located on the adaxial (upper) side and consists of elongated cells aligned vertically and parallel to each other. This arrangement is crucial for maximizing light absorption for photosynthesis.</p>\n\n<p>Based on the explanation above, the correct evaluation of the given statements is:</p>\n\n<p><strong>Option B:</strong> <em>Statement I is false but Statement II is true</em>.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>Given below are two statements:</p>\n<p>Statement I : Parenchyma is living but collenchyma is dead tissue.</p>\n<p>Statement II : Gymnosperms lack xylem vessels but presence of xylem vessels is the characteristic of angiosperms.</p>\n<p>In the light of the above statements, choose the correct answer from the options given below:</p>",
      "options": [
        {
          "key": "A",
          "value": "Both Statement I and Statement II are true\n"
        },
        {
          "key": "B",
          "value": "Both Statement I and Statement II are false\n"
        },
        {
          "key": "C",
          "value": "Statement I is true but Statement II is false\n"
        },
        {
          "key": "D",
          "value": "Statement I is false but Statement II is true\n"
        }
      ],
      "answer": "D",
      "explanation": "<p>Let's analyze each statement separately to determine the correct answer:</p>\n\n<p><strong>Statement I: Parenchyma is living but collenchyma is dead tissue.</strong></p>\n\n<p>This statement is incorrect. Parenchyma and collenchyma are both types of simple tissues found in plants. Parenchyma is indeed a living tissue comprised of cells that are often involved in metabolic processes, storage, and photosynthesis. Collenchyma, similarly, is also a living tissue. It is known for providing support and mechanical strength to growing parts of a plant such as leaves and stems, particularly in areas where growth is active. The cells of collenchyma are elongated and have thicker primary walls compared to parenchyma, but they are definitely living.</p>\n\n<p><strong>Statement II: Gymnosperms lack xylem vessels but the presence of xylem vessels is the characteristic of angiosperms.</strong></p>\n\n<p>This statement is true. Gymnosperms are a group of seed-producing plants that include conifers, cycads, Ginkgo, and Gnetales. One of the distinguishing features of gymnosperms is that their xylem consists of tracheids but lacks vessels. Tracheids are elongated cells in the xylem of vascular plants that facilitate the transport of water and mineral salts. On the other hand, angiosperms, or flowering plants, have a more advanced xylem that contains both tracheids and vessels. Vessels are more efficient at transporting water than tracheids, which is one of the evolutionary advantages of angiosperms over gymnosperms.</p>\n\n<p>Therefore, considering the above explanations:</p>\n\n<ul>\n\n<li>Statement I is <strong>false</strong> as both parenchyma and collenchyma are living tissues.</li>\n\n<li>Statement II is <strong>true</strong> regarding the absence of xylem vessels in gymnosperms and their presence in angiosperms.</li>\n\n</ul>\n\n<p>Based on the analysis, the correct answer is:</p>\n\n<p><b>Option D: Statement I is false but Statement II is true</b></p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>The transverse section of a plant part showed polyarch, radial and exarch xylem, with endodermis and pericycle. The plant part is identified as :</p>",
      "options": [
        {
          "key": "A",
          "value": "Monocot root"
        },
        {
          "key": "B",
          "value": "Dicot root"
        },
        {
          "key": "C",
          "value": "Dicot stem"
        },
        {
          "key": "D",
          "value": "Monocot stem"
        }
      ],
      "answer": "A",
      "explanation": "Radial vascular bundles are present in roots. Monocot roots have polyarch and exarch condition of\nxylem."
    },
    {
      "_type": "single_mcq",
      "body": "<p>Consider the following tissues in the stelar region of a stem showing secondary growth.</p>\n<p>(A) Primary xylem</p>\n<p>(B) Secondary xylem</p>\n<p>(C) Primary phloem</p>\n<p>(D) Secondary phloem</p>\n<p>Arrange these in the correct sequence of their position from pith towards corts.</p>",
      "options": [
        {
          "key": "A",
          "value": "(A), (B), (D), (C)"
        },
        {
          "key": "B",
          "value": "(B), (A), (C), (D)"
        },
        {
          "key": "C",
          "value": "(A), (B), (C), (D)"
        },
        {
          "key": "D",
          "value": "(B), (A), (D), (C)"
        }
      ],
      "answer": "A",
      "explanation": "The correct sequence of tissues in the stelar region of the stem showing secondary growth from pith\ntowards cortex is : \n<br/><br/>Primary Xylem → Secondary Xylem → Secondary Phloem → Primary Phloem"
    },
    {
      "_type": "single_mcq",
      "body": "<p>Consider the following plant tissues :</p>\n<p>(A) Axillary buds</p>\n<p>(B) Fascicular vascular cambium</p>\n<p>(C) Interfascicular cambium</p>\n<p>(D) Cork cambium</p>\n<p>(E) Intercalary meristem</p>\n<p>Identify the lateral meristems among the above.</p>",
      "options": [
        {
          "key": "A",
          "value": "(A), (C) and (D) only"
        },
        {
          "key": "B",
          "value": "(B), (C) and (D) only"
        },
        {
          "key": "C",
          "value": "(A), (B), (C) and (E) only"
        },
        {
          "key": "D",
          "value": "(A), (B), (D) and (E) only"
        }
      ],
      "answer": "B",
      "explanation": "<p>Option B : (B), (C) and (D) only</p>\n<p>Explanation : Lateral meristems are the meristems that add to the width or girth in a process known as secondary growth. They are responsible for the secondary growth in plants and are found parallel to the sides of the plants.</p>\n<ol>\n<li>1. Axillary buds (A) are not lateral meristems; they are capable of forming branches or flowers.</li>\n<br/><li>2. Fascicular vascular cambium (B) is a type of lateral meristem. It contributes to secondary growth and produces secondary vascular tissues.</li>\n<br/><li>3. Interfascicular cambium (C) is also a type of lateral meristem. It also contributes to secondary growth in the stem.</li>\n<br/><li>4. Cork cambium (D), also called phellogen, is a lateral meristem and it produces the cork, a part of the protective outer layer (periderm) in stems and roots.</li>\n<br/><li>5. Intercalary meristem (E) is not a type of lateral meristem but rather a type of apical meristem located at the base of leaves or internodes on a plant stem, which is involved in primary growth and elongation of the plant.</li>\n</ol>\n<p>Therefore, the correct answer is option B : Fascicular vascular cambium (B), Interfascicular cambium (C) and Cork cambium (D) only.</p>\n"
    },
    {
      "_type": "single_mcq",
      "body": "<p>Given below are two statements : One is labelled as Assertion A and the other is labelled as Reason R :</p>\n<p>Assertion A : Late wood has fewer xylary elements with narrow vessels.</p>\n<p>Reason R : Cambium is less active in winters.</p>\n<p>In the light of the above statements, choose the correct answer from the options given below :</p>",
      "options": [
        {
          "key": "A",
          "value": "Both A and R are true but R is NOT the correct explanation of A"
        },
        {
          "key": "B",
          "value": "A is true but R is false"
        },
        {
          "key": "C",
          "value": "A is false but R is true"
        },
        {
          "key": "D",
          "value": "Both A and R are true and R is the correct explanation of A"
        }
      ],
      "answer": "D",
      "explanation": "<p>Late wood, formed in the latter part of the growing season, indeed has fewer xylary elements with narrower vessels. This is because the cambium, the layer of cells in plants that gives rise to secondary xylem (wood), is less active in colder temperatures, which are typically associated with the later parts of the growing season, such as autumn and winter.</p>\n<p>So, both Assertion A and Reason R are true. Moreover, Reason R correctly explains why Assertion A is the case: the decreased activity of the cambium in colder temperatures results in the formation of late wood with fewer, narrower vessels.</p>\n<p>Therefore, the correct answer is :</p>\n<p>Option D : Both A and R are true and R is the correct explanation of A.</p>\n"
    },
    {
      "_type": "single_mcq",
      "body": "<p>Given below are two statements :</p>\n<p>Statement I : Endarch and exarch are the terms often used for describing the position of secondary xylem \nin the plant body.</p>\n<p>Statement II : Exarch condition is the most common feature of the root system.</p>\n<p>In the light of the above statements, choose the correct answer from the options given below:</p>",
      "options": [
        {
          "key": "A",
          "value": "Both Statement I and Statement II are false"
        },
        {
          "key": "B",
          "value": "Statement I is correct but Statement II is false"
        },
        {
          "key": "C",
          "value": "Statement I is incorrect but Statement II is true"
        },
        {
          "key": "D",
          "value": "Both Statement I and Statement II are true"
        }
      ],
      "answer": "C",
      "explanation": "<p>Statement I : Endarch and exarch are the terms often used for describing the position of secondary xylem in the plant body.</p>\n<ul>\n<li>This statement is incorrect. Endarch and exarch are used to describe the developmental sequence of primary xylem, not secondary xylem. In endarch condition, the first formed xylem is towards the centre (protoxylem) and the last formed xylem is towards the periphery (metaxylem), which is typical of stems. In the exarch condition, the first formed xylem is towards the periphery and the last formed xylem is towards the centre, which is typical of roots.</li>\n</ul>\n<p>Statement II : Exarch condition is the most common feature of the root system.</p>\n<ul>\n<li>This statement is true. The exarch condition, where the first-formed xylem is towards the periphery and the last-formed xylem is towards the centre, is indeed the most common feature of the root system.</li>\n</ul>\n<p>So, the correct answer is :</p>\n<p>Option C : Statement I is incorrect but Statement II is true.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>Interfascicular cambium is present between</p>",
      "options": [
        {
          "key": "A",
          "value": "Secondary xylem and secondary phloem"
        },
        {
          "key": "B",
          "value": "Primary xylem and primary phloem"
        },
        {
          "key": "C",
          "value": "Pericycle and endodermis"
        },
        {
          "key": "D",
          "value": "Two vascular bundles"
        }
      ],
      "answer": "D",
      "explanation": "During secondary growth in dicot stem, the cells of medullary rays lie between the vascular bundles \nbecome dedifferentiated and give rise to new cambium called interfascicular cambium."
    },
    {
      "_type": "single_mcq",
      "body": "<p>Initiation of lateral roots and vascular cambium during secondary growth takes place in cells of</p>",
      "options": [
        {
          "key": "A",
          "value": "Pericycle"
        },
        {
          "key": "B",
          "value": "Epiblema"
        },
        {
          "key": "C",
          "value": "Cortex"
        },
        {
          "key": "D",
          "value": "Endodermis"
        }
      ],
      "answer": "A",
      "explanation": "<p>Initiation of lateral roots and vascular cambium during secondary growth takes place in pericycle cells \nof dicot roots. Epiblema, endodermis and cortex do not dedifferentiate.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>\"Girdling Experiment\" was performed by Plant Physiologists to identify the plant tissue through which:</p>",
      "options": [
        {
          "key": "A",
          "value": "water is transported"
        },
        {
          "key": "B",
          "value": "food is transported"
        },
        {
          "key": "C",
          "value": "for both water and food transportation"
        },
        {
          "key": "D",
          "value": "osmosis is observed"
        }
      ],
      "answer": "B",
      "explanation": "<p>The girdling experiment shows that phloem is the tissue responsible for translocation of food; and that transport takes place in one direction i.e. towards the root.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>Read the following statements about the vascular bundles:</p>\n<p>(a) In roots, xylem and phloem in a vascular bundle are arranged in an alternate manner along the different radii.</p>\n<p>(b) Conjoint closed vascular bundles do not possess cambium</p>\n<p>(c) In open vascular bundles, cambium is present in between xylem and phloem</p>\n<p>(d) The vascular bundles of dicotyledonous stem possess endarch protoxylem</p>\n<p>(e) In monocotyledonous root, usually there are more than six xylem bundles present</p>\n<p>Choose the correct answer from the options given below :</p>",
      "options": [
        {
          "key": "A",
          "value": "(a), (b) and (d) only"
        },
        {
          "key": "B",
          "value": "(b), (c), (d) and (e) only"
        },
        {
          "key": "C",
          "value": "(a), (b), (c) and (d) only"
        },
        {
          "key": "D",
          "value": "(a), (c), (d) and (e) only"
        }
      ],
      "answer": "A",
      "explanation": "<p>All the statements are correct regarding vascular bundles but none of the options with such combination is given.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>In old trees the greater part of secondary xylem is dark brown and resistant to insect attack due to :</p>\n<p>(a) secretion of secondary metabolities and their deposition in the lumen of vessels.</p>\n<p>(b) deposition of organic compounds like tannins and resins in the central layers of stem.</p>\n<p>(c) deposition of suberin and aromatic substances in the outer layer of stem.</p>\n<p>(d) deposition of tannins, gum, resin and aromatic substances in the peripheral layers of stem.</p>\n<p>(e) presence of parenchyma cells, functionally active xylem elements and essential oils.</p>\n<p>Choose the correct answer from the options given below :</p>",
      "options": [
        {
          "key": "A",
          "value": "(a) and (b) only"
        },
        {
          "key": "B",
          "value": "(c) and (d) only"
        },
        {
          "key": "C",
          "value": "(d) and (e) only"
        },
        {
          "key": "D",
          "value": "(b) and (d) only"
        }
      ],
      "answer": "A",
      "explanation": "<p>In old trees, the greater part of secondary xylem is dark brown due to deposition of organic compounds like tannins, resins, oils, gums, aromatic substances and essential oils in the central or innermost layers of the stem. These substances make it hard, durable and resistant to the attacks of micro-organisms and insects.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>what is the role of large bundle sheath cells found around the vascular bundles in C<sub>4</sub> plants?</p>",
      "options": [
        {
          "key": "A",
          "value": "To provide the site for photorespiratory pathway"
        },
        {
          "key": "B",
          "value": "To increase the number of chloroplast for the operation of Calvin cycle"
        },
        {
          "key": "C",
          "value": "To enable the plant to tolerate high temperature"
        },
        {
          "key": "D",
          "value": "To protect the vascular tissue from high light intensity"
        }
      ],
      "answer": "B",
      "explanation": "<p>The large cells around the vascular bundles of C<sub>4</sub> plants form bundle sheath. These cells have large number of chloroplasts to perform calvin cycle.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "<p>The anatomy of springwood shows some peculiar features. Identify the correct set of statements about springwood.</p>\n<p>(a) It is also called as the earlywood</p>\n<p>(b) In spring season cambium produces xylem elements with narrow vessels</p>\n<p>(c) It is lighter in colour</p>\n<p>(d) The springwood along with autumn wood shows alternate concentric rings forming annual rings</p>\n<p>(e) It has lower density</p>\n<p>Choose the correct answer from the options given below:</p>",
      "options": [
        {
          "key": "A",
          "value": "(a), (b), (d) and (e) only"
        },
        {
          "key": "B",
          "value": "(a), (c), (d) and (e) only"
        },
        {
          "key": "C",
          "value": "(a), (b) and (d) only"
        },
        {
          "key": "D",
          "value": "(c), (d) and (e) only"
        }
      ],
      "answer": "B",
      "explanation": "<p>Spring wood is also called early wood. It is lighter in colour and has a lower density. The vessels are produced with the wider lumens to transport more water to meet the requirement by increased transpiring surface in spring season.</p>\n<p>The spring and autumn wood appear as alternate concentric rings of light and dark colour forming annual rings.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "Match List-I with List-II.<br><br><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-amwm{font-weight:bold;text-align:center;vertical-align:top}\n.tg .tg-0lax{text-align:left;vertical-align:top}\n</style>\n<table class=\"tg\">\n<thead>\n  <tr>\n    <th class=\"tg-amwm\"></th>\n    <th class=\"tg-amwm\">List-I</th>\n    <th class=\"tg-amwm\"></th>\n    <th class=\"tg-amwm\">List-II</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td class=\"tg-0lax\">(a)</td>\n    <td class=\"tg-0lax\">Lenticels</td>\n    <td class=\"tg-0lax\">(i)</td>\n    <td class=\"tg-0lax\">Phellogen</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0lax\">(b)</td>\n    <td class=\"tg-0lax\">Cork cambium</td>\n    <td class=\"tg-0lax\">(ii)</td>\n    <td class=\"tg-0lax\">Suberin deposition</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0lax\">(c)</td>\n    <td class=\"tg-0lax\">Secondary cortex</td>\n    <td class=\"tg-0lax\">(iii)</td>\n    <td class=\"tg-0lax\">Exchange of gases</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0lax\">(d)</td>\n    <td class=\"tg-0lax\">Cork</td>\n    <td class=\"tg-0lax\">(iv)</td>\n    <td class=\"tg-0lax\">Phelloderm</td>\n  </tr>\n</tbody>\n</table><br><br>Choose the correct answer from the options given below.",
      "options": [
        {
          "key": "A",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(iv)</td>\n    <td>(ii)</td>\n    <td>(i)</td>\n    <td>(iii)</td>\n  </tr>\n</tbody>\n</table>"
        },
        {
          "key": "B",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(iv)</td>\n    <td>(i)</td>\n    <td>(iii)</td>\n    <td>(ii)</td>\n  </tr>\n</tbody>\n</table>"
        },
        {
          "key": "C",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(iii)</td>\n    <td>(i)</td>\n    <td>(iv)</td>\n    <td>(ii)</td>\n  </tr>\n</tbody>\n</table>"
        },
        {
          "key": "D",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(ii)</td>\n    <td>(iii)</td>\n    <td>(iv)</td>\n    <td>(i)</td>\n  </tr>\n</tbody>\n</table>"
        }
      ],
      "answer": "C",
      "explanation": "$$\\bullet$$ Lenticels are meant for exchange of gases.<br><br>$$\\bullet$$ Phellogen is also known as cork cambium.<br><br>$$\\bullet$$ Phelloderm is also called secondary cortex because it is the cortex that develops during secondary growth.<br><br>$$\\bullet$$ Cork has deposition of suberin in their cell walls when they get mature."
    },
    {
      "_type": "single_mcq",
      "body": "Match List-I with List-II.<br><br><style type=\"text/css\">\n.tg  {border-collapse:collapse;border-spacing:0;}\n.tg td{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg th{border-color:black;border-style:solid;border-width:1px;font-family:Arial, sans-serif;font-size:14px;\n  font-weight:normal;overflow:hidden;padding:10px 5px;word-break:normal;}\n.tg .tg-7btt{border-color:inherit;font-weight:bold;text-align:center;vertical-align:top}\n.tg .tg-0pky{border-color:inherit;text-align:left;vertical-align:top}\n</style>\n<table class=\"tg\">\n<thead>\n  <tr>\n    <th class=\"tg-7btt\"></th>\n    <th class=\"tg-7btt\">List-I</th>\n    <th class=\"tg-7btt\"></th>\n    <th class=\"tg-7btt\">List-II</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td class=\"tg-0pky\">(a)</td>\n    <td class=\"tg-0pky\">Cells with active cell division capacity</td>\n    <td class=\"tg-0pky\">(i)</td>\n    <td class=\"tg-0pky\">Vascular tissues</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">(b)</td>\n    <td class=\"tg-0pky\">Tissue having all cells similar in structure and function</td>\n    <td class=\"tg-0pky\">(ii)</td>\n    <td class=\"tg-0pky\">Meristematic tissue</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">(c)</td>\n    <td class=\"tg-0pky\">Tissue having different types of cells</td>\n    <td class=\"tg-0pky\">(iii)</td>\n    <td class=\"tg-0pky\">Sclereids</td>\n  </tr>\n  <tr>\n    <td class=\"tg-0pky\">(d)</td>\n    <td class=\"tg-0pky\">Dead cells with highly thickened walls and narrow lumen</td>\n    <td class=\"tg-0pky\">(iv)</td>\n    <td class=\"tg-0pky\">Simple tissue</td>\n  </tr>\n</tbody>\n</table><br><br>Select the correct answer from the options given below.",
      "options": [
        {
          "key": "A",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(iii)</td>\n    <td>(ii)</td>\n    <td>(iv)</td>\n    <td>(i)</td>\n  </tr>\n</tbody>\n</table>"
        },
        {
          "key": "B",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(ii)</td>\n    <td>(iv)</td>\n    <td>(i)</td>\n    <td>(iii)</td>\n  </tr>\n</tbody>\n</table>"
        },
        {
          "key": "C",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(iv)</td>\n    <td>(iii)</td>\n    <td>(ii)</td>\n    <td>(i)</td>\n  </tr>\n</tbody>\n</table>"
        },
        {
          "key": "D",
          "value": "<table>\n<thead>\n  <tr>\n    <th>(a)</th>\n    <th>(b)</th>\n    <th>(c)</th>\n    <th>(d)</th>\n  </tr>\n</thead>\n<tbody>\n  <tr>\n    <td>(i)</td>\n    <td>(ii)</td>\n    <td>(iii)</td>\n    <td>(iv)</td>\n  </tr>\n</tbody>\n</table>"
        }
      ],
      "answer": "B",
      "explanation": "(a) Meristematic tissues are those tissues which have cells with active cell division capacity.<br><br>(b) Simple tissues are those tissues which have all the cells similar in structure and function.<br><br>(c) Vascular tissues are complex permanent tissues hence they have different types of cells.<br><br>(d) Sclereids are sclerenchymatous cells which are dead with highly thickened walls and narrow lumen."
    },
    {
      "_type": "single_mcq",
      "body": "Select the correct pair.",
      "options": [
        {
          "key": "A",
          "value": "Loose parenchyma cells rupturing the epidermis and forming a lens shaped opening in bark - Spongy parenchyma"
        },
        {
          "key": "B",
          "value": "Large colorless empty cells in the epidermis of grass leaves - Subsidiary cells"
        },
        {
          "key": "C",
          "value": "In dicot leaves, vascular bundles are surrounded by large thick-walled cells - Conjunctive tissue"
        },
        {
          "key": "D",
          "value": "Cells of medullary rays that form part of cambial ring - Interfascicular cambium"
        }
      ],
      "answer": "D",
      "explanation": "$$\\bullet$$  When the cells of medullary rays differentiated, they give rise to the new cambium called interfascicular cambium.<br><br>$$\\bullet$$  Loose parenchyma cells rupturing the epidermis and forming a lens-shaped opening in bark are called complementary cells.<br><br>$$\\bullet$$  Large colorless empty cells in the epidermis of grass leaves are called bulliform cells.<br><br>$$\\bullet$$  In dicot leave, vascular bundles are surrounded by large thick walled cells called bundle sheath cells."
    },
    {
      "_type": "single_mcq",
      "body": "Identify the incorrect statement.",
      "options": [
        {
          "key": "A",
          "value": "Sapwood is involved in conduction of water and minerals from root to leaf"
        },
        {
          "key": "B",
          "value": "Sapwood is the innermost secondary xylem and is lighter in colour"
        },
        {
          "key": "C",
          "value": "Due to deposition of tannins, resins, oils etc., heart wood is dark in colour"
        },
        {
          "key": "D",
          "value": "Heart wood does not conduct water but gives mechanical support"
        }
      ],
      "answer": "B",
      "explanation": "<b>Correct statement:</b> Sapwood is outermost secondary xylem. Outer secondary xylem or sapwood serves in water conduction, while the inner part called heartwood is composed of dead but structurally strong primary xylem. "
    },
    {
      "_type": "single_mcq",
      "body": "The roots that originate from the base of the stem are",
      "options": [
        {
          "key": "A",
          "value": "Primary roots"
        },
        {
          "key": "B",
          "value": "Prop roots"
        },
        {
          "key": "C",
          "value": "Lateral roots"
        },
        {
          "key": "D",
          "value": "Fibrous roots"
        }
      ],
      "answer": "D",
      "explanation": "The roots that originate from the base of the stem are fibrous roots. A fibrous root system is the opposite of a taproot system. It is usually formed by thin, moderately branching roots growing from the stem. A fibrous root system is universal in monocotyledonous plants and ferns. The fibrous root systems look like a mat made out of roots when the tree has reached full maturity."
    },
    {
      "_type": "single_mcq",
      "body": "The transverse section of a plant shows following anatomical features :\n<br><br> (i) Large number of scattered vascular bundles surrounded by bundle sheath <br>(ii) Large conspicuous parenchymatous ground tissue <br>(iii) Vascular bundles conjoint and closed <br>(iv) Phloem parenchyma absent <br><br>Identify the category of plant and its part: ",
      "options": [
        {
          "key": "A",
          "value": "Monocotyledonous root"
        },
        {
          "key": "B",
          "value": "Dicotyledonous stem"
        },
        {
          "key": "C",
          "value": "Dicotyledonous root"
        },
        {
          "key": "D",
          "value": "Monocotyledonous stem"
        }
      ],
      "answer": "D",
      "explanation": "The monocot stem is characterised by conjoint, collateral, and closed vascular bundles, scattered in the ground tissue containing the parenchyma. Each vascular bundle is surrounded by sclerenchymatous bundle-sheath cells. Phloem parenchyma and medullary rays are absent in monocot stems."
    },
    {
      "_type": "single_mcq",
      "body": "Phloem in gymnosperms lacks :",
      "options": [
        {
          "key": "A",
          "value": "Companion cells only"
        },
        {
          "key": "B",
          "value": "Both sieve tubes and companion cells"
        },
        {
          "key": "C",
          "value": "Albuminous cells and sieve cells"
        },
        {
          "key": "D",
          "value": "Sieve tubes only"
        }
      ],
      "answer": "B",
      "explanation": "In gymnosperms only sieve cells and albuminous cells are present but they lack sieve tubes and companion\ncells."
    },
    {
      "_type": "single_mcq",
      "body": "What is the direction of movement of sugars in phloem?",
      "options": [
        {
          "key": "A",
          "value": "Downward"
        },
        {
          "key": "B",
          "value": "Bi-directional"
        },
        {
          "key": "C",
          "value": "Non-multidirectional"
        },
        {
          "key": "D",
          "value": "Upward"
        }
      ],
      "answer": "B",
      "explanation": "The direction of movement of sugars in phloem is Bi-directional."
    },
    {
      "_type": "single_mcq",
      "body": "Which of the statements given below is not true about formation of Annual Rings in trees?",
      "options": [
        {
          "key": "A",
          "value": "Activity of cambium depends upon variation in climate."
        },
        {
          "key": "B",
          "value": "Annula ring are not prominent in trees of temperate region."
        },
        {
          "key": "C",
          "value": "Annula ring is a combination of spring wood and autumn wood produced in a year."
        },
        {
          "key": "D",
          "value": "Differential activity of cambium causes light and dark bands of tissue-early and late wood respectively "
        }
      ],
      "answer": "B",
      "explanation": "Annual rings are prominent only in tress of temperate region. In temperate regions climatic conditions are not uniform throughout the year. So, there is no differential activity of cambium. However in tropics climatic conditions are uniform throughout the year."
    },
    {
      "_type": "single_mcq",
      "body": "Stomata in grass leaf are ",
      "options": [
        {
          "key": "A",
          "value": "kidney-shaped "
        },
        {
          "key": "B",
          "value": "barrel-shaped"
        },
        {
          "key": "C",
          "value": "dumb-bell shaped "
        },
        {
          "key": "D",
          "value": "rectangular"
        }
      ],
      "answer": "C",
      "explanation": "Grass being a monocot, has Dumb-bell\nshaped stomata in their leaves."
    },
    {
      "_type": "single_mcq",
      "body": "Secondary xylem and phloem in dicot stem are produced by",
      "options": [
        {
          "key": "A",
          "value": "vascular cambium "
        },
        {
          "key": "B",
          "value": "axillary meristems"
        },
        {
          "key": "C",
          "value": "apical meristems "
        },
        {
          "key": "D",
          "value": "phellogen"
        }
      ],
      "answer": "A",
      "explanation": "The cells of vascular cambium cut off towards pith,  mature into secondary xylem and the cells cut off  towards periphery mature into secondary phloem during secondary growth in dicot stem."
    },
    {
      "_type": "single_mcq",
      "body": "Casparian strips occur in ",
      "options": [
        {
          "key": "A",
          "value": "pericycle"
        },
        {
          "key": "B",
          "value": "epidermis"
        },
        {
          "key": "C",
          "value": "endodermis. "
        },
        {
          "key": "D",
          "value": "cortex"
        }
      ],
      "answer": "C",
      "explanation": "Endodermis have casparian strips on radial\nand inner tangential wall. It is rich in suberin."
    },
    {
      "_type": "single_mcq",
      "body": "Plants having little or no secondary growth are ",
      "options": [
        {
          "key": "A",
          "value": "deciduous angiosperms "
        },
        {
          "key": "B",
          "value": "grasses"
        },
        {
          "key": "C",
          "value": "cycads"
        },
        {
          "key": "D",
          "value": "conifers"
        }
      ],
      "answer": "B",
      "explanation": "Grasses are monocots and monocots\nusually do not have secondary growth.\n<br>Palm like monocots have anomalous\nsecondary growth"
    },
    {
      "_type": "single_mcq",
      "body": "Which of the following is made up of dead cells ?",
      "options": [
        {
          "key": "A",
          "value": "Collenchyma"
        },
        {
          "key": "B",
          "value": "Xylem parenchyma"
        },
        {
          "key": "C",
          "value": "Phellem"
        },
        {
          "key": "D",
          "value": "Phloem"
        }
      ],
      "answer": "C",
      "explanation": "Cork cambium undergoes periclinal\ndivision and cuts off thick walled suberised\ndead cells towards outside i.e. phellem (cork)\nand it cuts off thin walled living cells i.e.,\nphelloderm on inner side."
    },
    {
      "_type": "single_mcq",
      "body": "Identify the wrong statement in context of heartwood :",
      "options": [
        {
          "key": "A",
          "value": "It is highly durable."
        },
        {
          "key": "B",
          "value": "It comprises dead elements with highly lignified walls"
        },
        {
          "key": "C",
          "value": "It conducts water and minerals efficiently"
        },
        {
          "key": "D",
          "value": "Organic compounds are deposited in it\n"
        }
      ],
      "answer": "C",
      "explanation": "Heartwood is inactive physiologically\ndue to deposition of organic compounds and\nformation of tyloses so it will not conduct\nwater and minerals."
    },
    {
      "_type": "single_mcq",
      "body": "Root hairs develop from the region of :\n",
      "options": [
        {
          "key": "A",
          "value": "Meristematic activity"
        },
        {
          "key": "B",
          "value": "Root cap"
        },
        {
          "key": "C",
          "value": "Maturation"
        },
        {
          "key": "D",
          "value": "Elongation"
        }
      ],
      "answer": "C",
      "explanation": "In roots, the root hairs develops from\nzone of maturation. This zone is differentiated\nzone thus bearing root hairs."
    },
    {
      "_type": "single_mcq",
      "body": "The vascular cambium normally gives rise to :",
      "options": [
        {
          "key": "A",
          "value": "Primary phloem"
        },
        {
          "key": "B",
          "value": "Secondary xylem"
        },
        {
          "key": "C",
          "value": "Periderm"
        },
        {
          "key": "D",
          "value": "Phelloderm"
        }
      ],
      "answer": "B",
      "explanation": "Cells of vascular cambium divide\npericlinally both on the outer and inner sides to form\nsecondary permanent tissues, i.e., secondary xylem\nand secondary phloem.\n"
    },
    {
      "_type": "single_mcq",
      "body": "Cortex is the region found between -",
      "options": [
        {
          "key": "A",
          "value": "endodermis and pith "
        },
        {
          "key": "B",
          "value": "endodermis and vascular bundle "
        },
        {
          "key": "C",
          "value": "epidermis and stele"
        },
        {
          "key": "D",
          "value": "pericycle and endodermis\n"
        }
      ],
      "answer": "C",
      "explanation": "<p>In botanical terms, the cortex of a plant is the region found between the epidermis and the stele. Therefore, the correct answer is:</p>\n<p>Option C: Epidermis and stele.</p>\n<p>To clarify:</p>\n<ul>\n<li><p><strong>Epidermis:</strong> This is the outermost layer of cells in the plant stem and root. It serves as a protective barrier against the external environment.</p>\n</li>\n<br/><li><p><strong>Stele:</strong> This is the central part of the root or stem, containing the vascular tissue (xylem and phloem), pith, and often a pericycle. The stele is located inside the endodermis.</p>\n</li>\n</ul>\n<p>The cortex lies between these two layers, functioning mainly in storage and transport of nutrients and water. It is composed primarily of parenchyma cells and is a significant part of the root and stem where it often stores starch.</p>\n<p>The other options refer to different parts of the plant anatomy:</p>\n<ul>\n<li><p>Option A: &quot;Endodermis and pith&quot; - The pith is located in the center of the stem, surrounded by the vascular tissue, which is inside the endodermis. The cortex is not between these two.</p>\n</li>\n<br/><li><p>Option B: &quot;Endodermis and vascular bundle&quot; - The endodermis is a single layer of cells forming a boundary between the cortex and the stele; it doesn&#39;t define the boundaries of the cortex.</p>\n</li>\n<br/><li><p>Option D: &quot;Pericycle and endodermis&quot; - The pericycle is a layer of cells found just inside the endodermis, and it is part of the stele. This option does not correctly describe the position of the cortex.</p>\n</li>\n</ul>\n<p>Thus, Option C is the most accurate in describing the location of the cortex in a plant.</p>"
    },
    {
      "_type": "single_mcq",
      "body": "The balloon-shaped structures called tyloses",
      "options": [
        {
          "key": "A",
          "value": "are extensions of xylem parenchyma cells into vessels"
        },
        {
          "key": "B",
          "value": "originate in the lumen of vessels"
        },
        {
          "key": "C",
          "value": "are linked to the ascent of sap through xylem vessels"
        },
        {
          "key": "D",
          "value": "characterize the sapwood"
        }
      ],
      "answer": "A",
      "explanation": "Tyloses are balloon-like extensions of\nparenchyma cells that protrudes into the lumen of a\nneighbouring xylem vessel or tracheid through a pit\nin the cell wall. Tyloses form most commonly in older\nwoody tissue, possibly in response to injury, they may eventually block the vessels and thus prevent the spread of fungi and other pathogens within the plant.\nTyloses may become filled with tannins, gums,\npigments, etc., giving heartwood its dark colour, and\ntheir walls can remain thin or become lignified."
    },
    {
      "_type": "single_mcq",
      "body": "Specialised epidermal cells surrounding the guard cells are called -",
      "options": [
        {
          "key": "A",
          "value": "Lenticels"
        },
        {
          "key": "B",
          "value": "Complementary cells"
        },
        {
          "key": "C",
          "value": "Bulliform cells"
        },
        {
          "key": "D",
          "value": "Subsidiary cells"
        }
      ],
      "answer": "D",
      "explanation": "Specialized epidermal cells surrounding\nthe guard cells are known as Subsidiary or\naccessory cell."
    },
    {
      "_type": "single_mcq",
      "body": "Read the different components from (1) to\n(4) in the list given below and tell the\ncorrect order of the components with\nreference to their arrangement from outer\nside to inner side in a woody dicot stem :<br>\n (1) Secondary cortex<br>\n (2) Wood<br>\n (3) Secondary phoem<br>\n (4) Phellem<br>\n The correct order is : ",
      "options": [
        {
          "key": "A",
          "value": "(3), (4), (2), (1) "
        },
        {
          "key": "B",
          "value": "(4), (1), (3), (2) "
        },
        {
          "key": "C",
          "value": "(4), (3), (1), (2) "
        },
        {
          "key": "D",
          "value": "(1), (2), (4), (3)"
        }
      ],
      "answer": "B",
      "explanation": "The correct sequence from outerside to\ninner side in a woody dicot stem is as follows:\n Phellem → Secondary cortex →\nSecondary phloem → Wood , <b>[(4) → (1) →\n(3) → (2)]</b>\n"
    },
    {
      "_type": "single_mcq",
      "body": "Vascular bundles in monocotyledons are considered closed because ",
      "options": [
        {
          "key": "A",
          "value": "There are no vessels with perforations"
        },
        {
          "key": "B",
          "value": "Xylem is surrounded all around by phloem"
        },
        {
          "key": "C",
          "value": "A bundle sheath surrounds each bundle"
        },
        {
          "key": "D",
          "value": "Cambium is absent\n"
        }
      ],
      "answer": "D",
      "explanation": "<p>Vascular bundles in monocotyledons (plants with a single seed leaf, like grasses and grains) are considered &quot;closed&quot; primarily due to Option D: Cambium is absent.</p>\n<p>In botany, vascular bundles are the part of the plant that transport nutrients and water. In monocotyledons, these bundles are typically scattered throughout the stem and do not have a cambium layer. The cambium is a layer of actively dividing cells found in most dicotyledons (plants with two seed leaves) and is responsible for secondary growth, which includes the widening of the stems and roots. This secondary growth is possible because the cambium adds layers of vascular tissue called secondary xylem (wood) and secondary phloem.</p>\n<p>In monocotyledons, the absence of cambium means there&#39;s no secondary growth, and thus, the vascular bundles are termed &quot;closed.&quot; This is different from &quot;open&quot; vascular bundles found in dicotyledons, where the presence of cambium allows for continuous growth and change in the arrangement of the xylem and phloem.</p>\n<p>Options A, B, and C describe other aspects of vascular bundles but are not the reasons why monocotyledonous vascular bundles are considered closed. For instance:</p>\n<ul>\n<li>Option A: The presence or absence of vessels with perforations is more about the type of vessels in the xylem and not directly related to the concept of open or closed vascular bundles.</li>\n<br/><li>Option B: While xylem surrounded by phloem is a characteristic of some vascular bundles, it doesn&#39;t define them as open or closed.</li>\n<br/><li>Option C: A bundle sheath may be present in both monocotyledons and dicotyledons and is not a defining factor for open or closed vascular bundles. </li>\n</ul>\n<p>Therefore, Option D, &quot;Cambium is absent,&quot; is the correct reason for vascular bundles in monocotyledons being considered closed.</p>\n"
    },
    {
      "_type": "single_mcq",
      "body": "A major characteristic of the monocot root is the presence of :\n",
      "options": [
        {
          "key": "A",
          "value": "Vasculature without cambium"
        },
        {
          "key": "B",
          "value": "Cambium sandwiched between phloem and xylem along the radius"
        },
        {
          "key": "C",
          "value": "Open vascular bundles\n"
        },
        {
          "key": "D",
          "value": "Scattered vascular bundles\n"
        }
      ],
      "answer": "A",
      "explanation": "In monocot root, a large number of vascular\nbundles are arranged in the form of a ring around the\ncentral pith. Vascular bundles are closed because there\nis no cambium present between the xylem and\nphloem.\n"
    },
    {
      "_type": "single_mcq",
      "body": "Tracheids differ from other tracheary elements in : ",
      "options": [
        {
          "key": "A",
          "value": "being imperforate"
        },
        {
          "key": "B",
          "value": "having casparian strips "
        },
        {
          "key": "C",
          "value": "lacking nucleus "
        },
        {
          "key": "D",
          "value": "being lignified "
        }
      ],
      "answer": "A",
      "explanation": "The walls of vessels (tracheary elements)\nare lignified and less thicker than tracheids.\nThe lumen is wider. Vessels differ from\ntracheids in having cell fusions arising\nthrough the dissolution of end walls."
    },
    {
      "_type": "single_mcq",
      "body": "You are given a fairly old piece of dicot stem and a dicot root. Which of the following\nanatomical structures will you use to distinguish between the two?",
      "options": [
        {
          "key": "A",
          "value": "Secondary xylem "
        },
        {
          "key": "B",
          "value": "Protoxylem "
        },
        {
          "key": "C",
          "value": "Secondary phloem "
        },
        {
          "key": "D",
          "value": "Cortical cells "
        }
      ],
      "answer": "B",
      "explanation": "Anatomically fairly old dicotyledonous\nroot is distinguished from the dicotyledonous\nstem by position of the protoxylem. In dicot\nroot, the protoxylem is located near the\nperiphery of the vascular cylinder while in\ndicot stem the protoxylem is located near\nthe centre of vascular bundle i.e., the xylem\nis endarch."
    },
    {
      "_type": "single_mcq",
      "body": "Bundle sheath cells :",
      "options": [
        {
          "key": "A",
          "value": "lack both RuBisCo and PEP carboxylase\n"
        },
        {
          "key": "B",
          "value": "are rich in PEP carboxylase"
        },
        {
          "key": "C",
          "value": "are rich in RuBisCo"
        },
        {
          "key": "D",
          "value": "lack RuBisCo"
        }
      ],
      "answer": "C",
      "explanation": "C<sub>4</sub> plants show kranz type of anatomy. In\nkranz anatomy, the mesophyll is undifferentiated and\nits cells occur in concentric layers around vascular\nbundles. The vascular bundles are surrounded by large\nsized bundle sheath cells which are arranged in wreath\nlike manner in one to several layers. In C<sub>4</sub>\n plants there\nare two carboxylation reactions, first in mesophyll\nchloroplast and second in bundle sheath chloroplast.\nRuBP is present in bundle sheath chloroplasts where\nC<sub>3</sub>\n cycle takes place."
    },
    {
      "_type": "single_mcq",
      "body": "Which of the following statements is not true for\nstomatal apparatus ?",
      "options": [
        {
          "key": "A",
          "value": "Stomata are involved in gaseous exchange\n"
        },
        {
          "key": "B",
          "value": "Inner walls of guard cells are thick"
        },
        {
          "key": "C",
          "value": "Guard cells invariably posses chloroplasts and\nmitochondria"
        },
        {
          "key": "D",
          "value": "Guard cells are always surrounded by subsidiary\ncells"
        }
      ],
      "answer": "D",
      "explanation": "Sometimes, a few epidermal cells in the\nvicinity of the guard cells become specialised\nin their shape and size and are known as\nsubsidiary cells or accessory cells."
    },
    {
      "_type": "single_mcq",
      "body": "Meristematic tissue responsible for increase in girth\nof tree trunk is :\n",
      "options": [
        {
          "key": "A",
          "value": "Phellogen"
        },
        {
          "key": "B",
          "value": "Intercalary meristem"
        },
        {
          "key": "C",
          "value": "Apical meristem"
        },
        {
          "key": "D",
          "value": "Lateral meristem"
        }
      ],
      "answer": "D",
      "explanation": "Lateral meristems are meristems which\noccur parallel to the circumference of the\norgans in which they develop. They undergo\npericlinal divisions producing secondary\ntissues on the outer and inner sides and\nincrease the girth of the plant organs.\nExamples are vascular cambium and corkcambium."
    },
    {
      "_type": "single_mcq",
      "body": "Age of a tree can be estimated by : ",
      "options": [
        {
          "key": "A",
          "value": "Diameter of its heartwood "
        },
        {
          "key": "B",
          "value": "Number of annual rings "
        },
        {
          "key": "C",
          "value": "Its height and girth"
        },
        {
          "key": "D",
          "value": "Biomass"
        }
      ],
      "answer": "B",
      "explanation": "Age of a tree can be estimated by number\nof annual rings. Annual ring constitute\nalternate concentric rings of spring wood and\nautumn wood."
    },
    {
      "_type": "single_mcq",
      "body": "Interfascicular cambium develops from the cells of : ",
      "options": [
        {
          "key": "A",
          "value": "Endodermis "
        },
        {
          "key": "B",
          "value": "Pericycle "
        },
        {
          "key": "C",
          "value": "Medullary rays"
        },
        {
          "key": "D",
          "value": "Xylem parenchyma"
        }
      ],
      "answer": "C",
      "explanation": "At the time of secondary growth interfascicular cambium is formed by parenchymatous medullary rays.\nInterfascicular cambium along with intrafascicular cambium (formed from cambium\ncells present between xylem and phloem)\nconstitute continuous cambium ring. If new\ncells are cut off in both directions it causes\nsecondary growth in most dicotyledonous\nplants. "
    },
    {
      "_type": "single_mcq",
      "body": "Lenticels are involved in ",
      "options": [
        {
          "key": "A",
          "value": "Food transport"
        },
        {
          "key": "B",
          "value": "Photosynthesis "
        },
        {
          "key": "C",
          "value": "Transpiration"
        },
        {
          "key": "D",
          "value": "Gaseous exchange"
        }
      ],
      "answer": "D",
      "explanation": "Lenticels are lens shaped openings formed\nin bark due to secondary growth. They permit gaseous\nexchange in woody trees. They also contribute to\ntranspiration but in minute amounts because the\nsuberised complementary cells present beneath the\npore prevent excessive water loss."
    },
    {
      "_type": "single_mcq",
      "body": "As compared to a dicot root, a monocot root has ",
      "options": [
        {
          "key": "A",
          "value": "More abundant secondary xylem "
        },
        {
          "key": "B",
          "value": "Relatively thicker periderm "
        },
        {
          "key": "C",
          "value": "Many xylem bundles "
        },
        {
          "key": "D",
          "value": "Inconspicuous annual rings "
        }
      ],
      "answer": "C",
      "explanation": "The vascular bundles are arranged in\na loose circle inside the endodermis of a\nmonocot root. In a monocot root, more than\nsix vascular bundles are present. It shows\npolyarch condition."
    },
    {
      "_type": "single_mcq",
      "body": "Closed vascular bundles lack ",
      "options": [
        {
          "key": "A",
          "value": "Ground tissue "
        },
        {
          "key": "B",
          "value": "Conjunctive tissue"
        },
        {
          "key": "C",
          "value": "Cambium "
        },
        {
          "key": "D",
          "value": "Pith "
        }
      ],
      "answer": "C",
      "explanation": "Vascular bundle consists of complex tissues,\nthe phloem and xylem. In dicots, between xylem and\nphloem, cambium is present which helps in secondary\ngrowth. This type of vascular bundle is called open.\nWhile in monocots cambium is absent, so these are\ncalled closed vascular bundles.\n"
    },
    {
      "_type": "single_mcq",
      "body": "Gymnosperms are also called soft wood spermatophytes because they lack",
      "options": [
        {
          "key": "A",
          "value": "Cambium "
        },
        {
          "key": "B",
          "value": "Thick - walled tracheids"
        },
        {
          "key": "C",
          "value": "Phloem fibres "
        },
        {
          "key": "D",
          "value": "Xylem fibres"
        }
      ],
      "answer": "D",
      "explanation": "Xylem fibres provide rigidity to the plant."
    },
    {
      "_type": "single_mcq",
      "body": "The common bottle cork is a product of",
      "options": [
        {
          "key": "A",
          "value": "Phellogen \n"
        },
        {
          "key": "B",
          "value": "Xylem "
        },
        {
          "key": "C",
          "value": "Vascular Cambium "
        },
        {
          "key": "D",
          "value": "Dermatogen"
        }
      ],
      "answer": "A",
      "explanation": "The common bottle cork is the product\nof phellogen. Phellogen produces cork or\nphellem on the outer side. It consists of dead\nand compactly arranged rectangular cells that\npossess suberised cell walls. The cork cells\ncontain tannins. Hence, they appear brown\nor dark brown in colour. The cork cells of\nsome plants are filled with air e.g., Quercus\nsuber (Cork Oak or Bottle Cork)."
    },
    {
      "_type": "single_mcq",
      "body": "Companion cells are closely associated with ",
      "options": [
        {
          "key": "A",
          "value": "Sieve elements"
        },
        {
          "key": "B",
          "value": "Trichomes "
        },
        {
          "key": "C",
          "value": "Vessel elements "
        },
        {
          "key": "D",
          "value": "Guard cells"
        }
      ],
      "answer": "A",
      "explanation": "Companion cell is a type of cell found\nwithin the phloem of flowering plants. Each\ncompanion cell is usually closely associated with a sieve element. They remain connected with sieve cells\nby plasmodesmata. They help in loading of phloem\nsieve cells with sugars through active transport.\n\n"
    },
    {
      "_type": "single_mcq",
      "body": "Water containing cavities in vascular bundles are found in ",
      "options": [
        {
          "key": "A",
          "value": "Maize"
        },
        {
          "key": "B",
          "value": "Cycas "
        },
        {
          "key": "C",
          "value": "Sunflower "
        },
        {
          "key": "D",
          "value": "Pinus"
        }
      ],
      "answer": "A",
      "explanation": "Stem of maize has water containing\ncavities in vascular bundles."
    },
    {
      "_type": "single_mcq",
      "body": "Some vascular bundles are described as open\nbecause these : ",
      "options": [
        {
          "key": "A",
          "value": "are capable of producing secondary xylem\nand phloem "
        },
        {
          "key": "B",
          "value": "are not surrounded by pericycle"
        },
        {
          "key": "C",
          "value": "possess conjunctive tissue between xylem\nand phloem "
        },
        {
          "key": "D",
          "value": "are surrounded by pericycle but no\nendodermis"
        }
      ],
      "answer": "A",
      "explanation": "In dicot stem, cambium is present between\nxylem and phloem, such vascular bundles are called\nopen. In monocot stem, the cambium is absent, such\nvascular bundles are called closed.\nCambium are the meristematic cells which produces\nsecondary xylem and phloem."
    },
    {
      "_type": "single_mcq",
      "body": "Function of companion cells is :",
      "options": [
        {
          "key": "A",
          "value": "Providing water to phloem "
        },
        {
          "key": "B",
          "value": "Loading of sucrose into sieve elements "
        },
        {
          "key": "C",
          "value": "Loading of sucrose into sieve elements by\npassive transport "
        },
        {
          "key": "D",
          "value": "Providing energy to sieve elements for active\ntransport "
        }
      ],
      "answer": "B",
      "explanation": "Companion cells move sugar and amino\nacids into and out of the sieve elements. In “source”\ntissue such as leaf companion cells use\ntransmembrane proteins to take up sugar and amino\nacids by active transport. Movement of sugars in the\nphloem begins at the source, where sugars are loaded\n(actively transported) into a seive tube. Loading sets\nup a water potential gradient that facilitates movement\nof sugar.\n"
    },
    {
      "_type": "single_mcq",
      "body": "The cork cambium, cork and secondary cortex\nare collectively called :",
      "options": [
        {
          "key": "A",
          "value": "Periderm"
        },
        {
          "key": "B",
          "value": "Phellem"
        },
        {
          "key": "C",
          "value": "Phellogen"
        },
        {
          "key": "D",
          "value": "Phelloderm "
        }
      ],
      "answer": "A",
      "explanation": "Phellem, phellogen and phelloderm are\ncollectively called periderm."
    },
    {
      "_type": "single_mcq",
      "body": "Ground tissue includes : \n",
      "options": [
        {
          "key": "A",
          "value": "All tissues external to endodermis "
        },
        {
          "key": "B",
          "value": "Epidermis and cortex "
        },
        {
          "key": "C",
          "value": "All tissues internal to endodermis "
        },
        {
          "key": "D",
          "value": "All tissues except epidermis and vascular\n bundles "
        }
      ],
      "answer": "D",
      "explanation": "Ground tissue includes all tissues except\nepidermis and vascular bundles. The ground\ntissue comprises the bulk of the primary\nplant body. Parenchyma, collenchyma\nand sclerenchyma cells are common in the\nground tissue."
    },
    {
      "_type": "single_mcq",
      "body": "Transport of food material in higher plants takes\nplace through - ",
      "options": [
        {
          "key": "A",
          "value": "Sieve elements "
        },
        {
          "key": "B",
          "value": "Transfusion tissue "
        },
        {
          "key": "C",
          "value": "Companion cells"
        },
        {
          "key": "D",
          "value": "Tracheids "
        }
      ],
      "answer": "A",
      "explanation": ""
    },
    {
      "_type": "single_mcq",
      "body": "Which one of the folliwng is not a lateral\nmeristem ?",
      "options": [
        {
          "key": "A",
          "value": "Interfascicular cambium "
        },
        {
          "key": "B",
          "value": "Intercalary meristem "
        },
        {
          "key": "C",
          "value": "Intrafascicular cambium "
        },
        {
          "key": "D",
          "value": "Phellogen "
        }
      ],
      "answer": "B",
      "explanation": "Meristem is classified on the basis of\nposition in plant bodies into lateral meristem, apical\nmeristem and intercalary meristem. Lateral meristem\nis present on the lateral sides, e.g., vascular cambium\n(fascicular and interfascicular cambium) and cork\ncambium (phellogen).\n"
    },
    {
      "_type": "single_mcq",
      "body": "Heartwood differs from sapwood in –",
      "options": [
        {
          "key": "A",
          "value": "Having dead and non-conducting elements "
        },
        {
          "key": "B",
          "value": "Being susceptible to pests and pathogens "
        },
        {
          "key": "C",
          "value": "Presence of rays and fibres "
        },
        {
          "key": "D",
          "value": "Abscence of vessels and parenchyma"
        }
      ],
      "answer": "A",
      "explanation": "Heartwood differs from sapwood in\nhaving dead and non-conducting elements.\nIn old trees, the inner region that comprises\ndead elements with highly lignified walls\nis called heartwood. Heartwood does not\nconduct water but gives mechanical support\nto the stem. On the other hand, the peripheral\nregion, which is lighter in colour is called\nsapwood. It is involved in the conduction of\nwater and minerals from root to leaf."
    },
    {
      "_type": "single_mcq",
      "body": "The chief water conducting elements of xylem\nin gymnosperms are :",
      "options": [
        {
          "key": "A",
          "value": "Fibres"
        },
        {
          "key": "B",
          "value": "Transfusion tissue "
        },
        {
          "key": "C",
          "value": "Vessels"
        },
        {
          "key": "D",
          "value": "Tracheids "
        }
      ],
      "answer": "D",
      "explanation": "Tracheids are chief water conducting\nelements of xylem in gymnosperms. They\nare devoid of protoplasm and hence dead. \n<br>The wall constituting the tracheids is hard,\nthick and lignified. These are elongated cells\nwith tapering ends."
    },
    {
      "_type": "single_mcq",
      "body": "Anatomically fairly old dicotyledonous root is\ndistinguished from the dicotyledonous stem by : ",
      "options": [
        {
          "key": "A",
          "value": "Absence of secondary phloem "
        },
        {
          "key": "B",
          "value": "Presence of cortex "
        },
        {
          "key": "C",
          "value": "Position of protoxylem "
        },
        {
          "key": "D",
          "value": "Absence of secondary xylem "
        }
      ],
      "answer": "C",
      "explanation": "Anatomically fairly old dicotyledonous\nroot is distinguished from the dicotyledonous\nstem by position of protoxylem. In dicot root\nthe protoxylem is located near the periphery\nof the vascular cylinder while in dicot stem\nthe protoxylem is located near the centre of\nvascular bundle i.e. the xylem is endarch."
    },
    {
      "_type": "single_mcq",
      "body": "The annular and spirally thickened conducting\nelements generally develop in the protoxylem\nwhen the root or stem is - ",
      "options": [
        {
          "key": "A",
          "value": "Maturing"
        },
        {
          "key": "B",
          "value": "Widening "
        },
        {
          "key": "C",
          "value": "Elongating "
        },
        {
          "key": "D",
          "value": "Differentiating"
        }
      ],
      "answer": "D",
      "explanation": "The annular and spirally thickened\nconducting elements generally develop in\nthe protoxylem when the root or stem is\nmaturing. "
    },
    {
      "_type": "single_mcq",
      "body": "In barley stem vascular bundles are - ",
      "options": [
        {
          "key": "A",
          "value": "Closed and scattered "
        },
        {
          "key": "B",
          "value": "Closed and radial "
        },
        {
          "key": "C",
          "value": "Open and in a ring"
        },
        {
          "key": "D",
          "value": "Open and scattered "
        }
      ],
      "answer": "A",
      "explanation": "In barley stem, vascular bundles are\nclosed and scattered. They are open only for\na hours in the day time and never open at\nnight. e.g Cereals."
    },
    {
      "_type": "single_mcq",
      "body": "Palisade parenchyma is absent in leaves of - ",
      "options": [
        {
          "key": "A",
          "value": "Mustard "
        },
        {
          "key": "B",
          "value": "Sorghum"
        },
        {
          "key": "C",
          "value": "Soybean "
        },
        {
          "key": "D",
          "value": "Gram "
        }
      ],
      "answer": "B",
      "explanation": "Palisade parenchyma is absent in leaves of\nSorghum. It is a monocot plant where the parenchyma\ntissues of the leaves are not differentiated into palisade\nand spongy"
    },
    {
      "_type": "single_mcq",
      "body": "Vascular tissues in flowering plants develop\nfrom: ",
      "options": [
        {
          "key": "A",
          "value": "plerome"
        },
        {
          "key": "B",
          "value": "periblem"
        },
        {
          "key": "C",
          "value": "phellogen"
        },
        {
          "key": "D",
          "value": "dermatogen "
        }
      ],
      "answer": "A",
      "explanation": "Vascular tissues in flowering plants\ndevelop from plerome. Plerome is a central\ncore of primary meristem which gives rise\nto all cells of the stele from the pericycle\ninward."
    },
    {
      "_type": "single_mcq",
      "body": "The length of different internodes in a culm of\nsugarcane is variable because of: ",
      "options": [
        {
          "key": "A",
          "value": "shoot apical meristem"
        },
        {
          "key": "B",
          "value": "position of axillary buds "
        },
        {
          "key": "C",
          "value": "size of leaf lamina at the node below each\ninternode "
        },
        {
          "key": "D",
          "value": "intercalary meristem "
        }
      ],
      "answer": "D",
      "explanation": "The length of different internodes in\na culm of sugarcane is variable because of\nintercalary meristem. Intercalary meristem\nis not a part of apical meristem. It occurs in\nthe internodes of grasses (sugarcane) between\nleaf nodes and enables longitudinal growth of\nthe stem."
    },
    {
      "_type": "single_mcq",
      "body": "For a critical study of secondary growth in plants,\nwhich one of the following pairs is suitable ? ",
      "options": [
        {
          "key": "A",
          "value": "Deodar and fern "
        },
        {
          "key": "B",
          "value": "Wheat and maiden hair fern "
        },
        {
          "key": "C",
          "value": "Sugarcane and sunflower "
        },
        {
          "key": "D",
          "value": "Teak and pine"
        }
      ],
      "answer": "D",
      "explanation": "Teak and pine are most suitable for the\nstudy of critical secondary growth because\nin secondary growth, secondary tissues are\nformed from lateral meristem which is well\ndeveloped in these two cases and secondary\ngrowth occurs in gymnosperms and dicots."
    },
    {
      "_type": "single_mcq",
      "body": "Passage cells are thin-walled cells found in:- ",
      "options": [
        {
          "key": "A",
          "value": "Endodermis of roots facilitating rapid\ntransport of water from cortex to pericycle"
        },
        {
          "key": "B",
          "value": "Testa of seeds to enable emergence of\ngrowing embryonic axis during seed\ngermination. "
        },
        {
          "key": "C",
          "value": "Phloem elements that serve as entry points\nfor substances for transport to other plant\nparts"
        },
        {
          "key": "D",
          "value": "Central region of style through which the\npollen tube grows towards the ovary. "
        }
      ],
      "answer": "A",
      "explanation": "Endodermis is a single layered structure\nwhich separates cortex from stele. There are both thick\nwalled and thin walled cells in the endodermis. The\nthin walled cells are known as passage cells or\ntransfusion cells which are opposite the protoxylem\ngroups. These cells help in rapid transport of water\nfrom cortex to pericycle."
    },
    {
      "_type": "single_mcq",
      "body": "A common structural feature of vessel elements\nand sieve tube elements is- ",
      "options": [
        {
          "key": "A",
          "value": "Enucleate condition "
        },
        {
          "key": "B",
          "value": "Presence of p-protein"
        },
        {
          "key": "C",
          "value": "Thick secondary walls "
        },
        {
          "key": "D",
          "value": "Pores on lateral wall "
        }
      ],
      "answer": "A",
      "explanation": "In plants, conducting tissue xylem has\nan important integral cell as xylem vessel\nwhich is enucleate. The phloem on other\nhand has a row of sieve tubes which are also\nenucleate at maturity."
    },
    {
      "_type": "single_mcq",
      "body": "In a woody dicotyledonous tree, which of the\nfollowing parts will mainly consist of primary\ntissues ?",
      "options": [
        {
          "key": "A",
          "value": "Shoot tips and root tips "
        },
        {
          "key": "B",
          "value": "Flowers, fruit and leaves "
        },
        {
          "key": "C",
          "value": "Stem and root"
        },
        {
          "key": "D",
          "value": "All parts "
        }
      ],
      "answer": "B",
      "explanation": "Primary Meristems : They are those\nmeristematic tissues which are dervied\ndirectly from the meristems of the embryo\nand retain their meristematic activity.\nThey are present at root, shoot tip and leaf\nprimordia."
    },
    {
      "_type": "single_mcq",
      "body": "In a longitudinal section of a root, starting from\nthe tip upward, the four zones occur in the\nfollowing order :- ",
      "options": [
        {
          "key": "A",
          "value": "Cell division, cell enlargement, cell\nmaturation, root cap "
        },
        {
          "key": "B",
          "value": "Root cap, cell division, cell enlargement, cell\nmaturation"
        },
        {
          "key": "C",
          "value": "Root cap, cell division, cell maturation, cell\nenlargement "
        },
        {
          "key": "D",
          "value": "Celldivision,cell maturation, cell enlargement,\nroot cap "
        }
      ],
      "answer": "B",
      "explanation": "Root shows the following regions<br>\nRoot cap or calyptra - caplike protective\ncovering over tip of the root<br>\nMeristematic region is the subapical position<br>\nZone of elongation - receives new cells from\nthe growing point<br>\nRoot hair zone - is the zone of differentiation<br>\nZone of mature cells - having thick walled\nimpermeable cells."
    },
    {
      "_type": "single_mcq",
      "body": "The cells of the quiescent centre are characterised\nby : - ",
      "options": [
        {
          "key": "A",
          "value": "Having light cytoplasm and small nuclei "
        },
        {
          "key": "B",
          "value": "Dividing regularly to add to tunica"
        },
        {
          "key": "C",
          "value": "Having dense cytoplasm and prominent\nnuclei"
        },
        {
          "key": "D",
          "value": "Dividing regularly to add to the corpus "
        }
      ],
      "answer": "A",
      "explanation": "The cells of queiscent centre have lower\nconcentration of DNA, RNA and protein\nas compared to other cells in the root apex.\nThese cells do not divide, hence cytoplasm\nis light and nuclei are small in them. This concept is based upon quiescent centre\ntheory proposed by Clowes (1961)."
    },
    {
      "_type": "single_mcq",
      "body": "Diffuse porous wood is characteristics of those\nplants which are growing in : - ",
      "options": [
        {
          "key": "A",
          "value": "Tropics "
        },
        {
          "key": "B",
          "value": "Temperate climate"
        },
        {
          "key": "C",
          "value": "Alpine region "
        },
        {
          "key": "D",
          "value": "Cold winter regions "
        }
      ],
      "answer": "A",
      "explanation": "In most of the gymnosperms, like conifers\nand cycads, vessels are absent and the wood is made\nentirely of tracheids. Such wood is known as\nnonporous.<br>\nIn angiosperms, on the other hand, the wood consists\nof both tracheids and vessels. The wide vessels appear\nas pores between otherwise small sized tracheary\nelements. Such a wood is known as porous. In porous\nwood, if vessels have essentially equal diameters and\nare uniformly distributed throughout the ring, the\nwood is known as diffuse porous. It is characteristic\nof plants growing in tropics."
    },
    {
      "_type": "single_mcq",
      "body": "Chlorenchyma is known to develop in the : - ",
      "options": [
        {
          "key": "A",
          "value": "Mycelium of a green mould such as\nAspergillus"
        },
        {
          "key": "B",
          "value": "Pollen tube of Pinus "
        },
        {
          "key": "C",
          "value": "Cytoplasm of Chlorella "
        },
        {
          "key": "D",
          "value": "Spore capsule of a moss "
        }
      ],
      "answer": "D",
      "explanation": "Chlorenchyma cells are those\nparenchymatous cell which contain\nchloroplast in them. They are capable of\nphotosynthesis. A spore capsule of moss can\nperform photosynthesis, thus chlorenchyma\nare present in them."
    },
    {
      "_type": "single_mcq",
      "body": "The aleurone layer in maize grain is specially\nrich in :- ",
      "options": [
        {
          "key": "A",
          "value": "Lipids "
        },
        {
          "key": "B",
          "value": "Proteins "
        },
        {
          "key": "C",
          "value": "Auxins "
        },
        {
          "key": "D",
          "value": "Starch"
        }
      ],
      "answer": "B",
      "explanation": "In monocotyledons the seeds are generally\nendospermous. The internal structure of grain can be\nstudied in a longitudinal section. It shows two distinct\nregions upper large region, the endosperm and lower\nsmaller region, the embryo. The endosperm is\nsurrounded by a special one cell thick layer, called\naleurone layer. It is filled with aleurone grains which\nare proteinaceous in nature. Other components of this\nlayer are phytin, carbohydrates and small amounts of\nphospholipids are also present.\n"
    },
    {
      "_type": "single_mcq",
      "body": "In which one of the following nitrogen is not a\nconstituent ?",
      "options": [
        {
          "key": "A",
          "value": "Pepsin"
        },
        {
          "key": "B",
          "value": "Invertase"
        },
        {
          "key": "C",
          "value": "Idioblast "
        },
        {
          "key": "D",
          "value": "Bacteriochlorophyll"
        }
      ],
      "answer": "C",
      "explanation": "The major storage component of Avocado\nfruit is oil. It is stored in specialized mesocarp cells\ncalled idioblast.\n"
    },
    {
      "_type": "single_mcq",
      "body": "The apical meristem of the root is present ",
      "options": [
        {
          "key": "A",
          "value": "In all the roots "
        },
        {
          "key": "B",
          "value": "Only in tap roots "
        },
        {
          "key": "C",
          "value": "Only in adventitious roots"
        },
        {
          "key": "D",
          "value": "Only in radicals"
        }
      ],
      "answer": "A",
      "explanation": "The apical meristem of the root is\npresent at all the root tips. Apical meristem\nis subterminal in position of the growing\nroot tips and responsible for terminal growth\nof the root in plants."
    },
    {
      "_type": "single_mcq",
      "body": "Which of the following statement is true ?",
      "options": [
        {
          "key": "A",
          "value": "Tracheids are unicellular and with wide\nlumen"
        },
        {
          "key": "B",
          "value": "Tracheids are multicellular and with narrow\nlumen "
        },
        {
          "key": "C",
          "value": "Vessels are multicellular and with wide\nlumen "
        },
        {
          "key": "D",
          "value": "Vessels are unicellular and with narrow\nlumen "
        }
      ],
      "answer": "A",
      "explanation": "Vessels are elongated, multicellular\nwater conducting channels with wide\nlumen formed by end to end fusion of a\nlarge number of vessel elements. Tracheids\nare elongated dead cells with tapering ends\nhaving lignified walls and large or wide\nlumen. Their main function is conduction\nof water and minerals from root to leaf."
    },
    {
      "_type": "single_mcq",
      "body": "Axillary bud and terminal bud derived from the\nactivity of : - ",
      "options": [
        {
          "key": "A",
          "value": "Apical meristem "
        },
        {
          "key": "B",
          "value": "Parenchyma "
        },
        {
          "key": "C",
          "value": "Lateral meristem "
        },
        {
          "key": "D",
          "value": "Intercalary meristem"
        }
      ],
      "answer": "A",
      "explanation": "Apical meristems are situated at the tips of\nthe root and shoot. They take part in initial growth.\nPlants elongate and increase in height as a result of\ndivisions in this meristem. Promeristem and primary\nmeristem (root and shoot apices) are included in this\ntype of meristem."
    },
    {
      "_type": "single_mcq",
      "body": "Vessels are found in : - ",
      "options": [
        {
          "key": "A",
          "value": "Most of the angiosperm and few\ngymnosperms"
        },
        {
          "key": "B",
          "value": "All angiosperms and some gymnosperm "
        },
        {
          "key": "C",
          "value": "All pteridophyta \n"
        },
        {
          "key": "D",
          "value": "All angiosperms, all gymnosperms and some\npteridophyta"
        }
      ],
      "answer": "A",
      "explanation": "Generally gymnosperms do not\nhave vessels but a few gymnosperms with\nvessels are Ephedra, Smilax etc. Most of\nangiosperms have vessels except of few e.g.,\nTrochodendron."
    },
    {
      "_type": "single_mcq",
      "body": "Four radial vascular bundle are found in : - ",
      "options": [
        {
          "key": "A",
          "value": "Monocot stem"
        },
        {
          "key": "B",
          "value": "Dicot stem"
        },
        {
          "key": "C",
          "value": "Dicot root "
        },
        {
          "key": "D",
          "value": "Monocot root "
        }
      ],
      "answer": "C",
      "explanation": "When xylem and phloem strands are\npresent at different radii the vascular bundles\nare radial and 4 radial vascular bundles\n(tetrach condition) are present in dicot root.\nThis is called tetrach conditions."
    },
    {
      "_type": "single_mcq",
      "body": "In plants inulin and pectin are ",
      "options": [
        {
          "key": "A",
          "value": "Excretory material "
        },
        {
          "key": "B",
          "value": "Reserved material "
        },
        {
          "key": "C",
          "value": "Insect attracting material "
        },
        {
          "key": "D",
          "value": "Wastes "
        }
      ],
      "answer": "B",
      "explanation": "Inulin is a water soluble fructosan. It is a\ncommon reserve food in members of family\ncompositae. Pectin is a mucopolysaccharides and\noccur in plant cell walls. At the time of fruit ripening\nwall of pectins hydrolyse to give constituent sugars.\n"
    },
    {
      "_type": "single_mcq",
      "body": "What happens in plants during vascularisation ?",
      "options": [
        {
          "key": "A",
          "value": "Formation of procambium, primary phloem\nand xylem simultaneousl"
        },
        {
          "key": "B",
          "value": "Differentiation of procambium followed by\nthe formation of secondary xylem "
        },
        {
          "key": "C",
          "value": "Differentiation of procambium, formation\nof primary phloem followed by formation\nof primary xylem"
        },
        {
          "key": "D",
          "value": "Differentiation of procambium followed by\nthe formation of primary phloem and\nxylem simultaneously "
        }
      ],
      "answer": "D",
      "explanation": "In plants during vascularisation, differentiation of procambium occurs followed by the formation\nof primary phloem and xylem simultaneously.\n"
    }
  ]
}